{
    "Assignments":  null,
    "CreatedDateTime":  "\/Date(1586258558398)\/",
    "Description":  "Device-Restriction-Policy",
    "DeviceManagementApplicabilityRuleDeviceMode":  {
                                                        "DeviceMode":  null,
                                                        "Name":  null,
                                                        "RuleType":  null
                                                    },
    "DeviceManagementApplicabilityRuleOSEdition":  {
                                                       "Name":  null,
                                                       "OSEditionTypes":  null,
                                                       "RuleType":  null
                                                   },
    "DeviceManagementApplicabilityRuleOSVersion":  {
                                                       "MaxOSVersion":  null,
                                                       "MinOSVersion":  null,
                                                       "Name":  null,
                                                       "RuleType":  null
                                                   },
    "DeviceSettingStateSummaries":  null,
    "DeviceStatusOverview":  {
                                 "ConfigurationVersion":  null,
                                 "ConflictCount":  null,
                                 "ErrorCount":  null,
                                 "FailedCount":  null,
                                 "Id":  null,
                                 "LastUpdateDateTime":  null,
                                 "NotApplicableCount":  null,
                                 "NotApplicablePlatformCount":  null,
                                 "PendingCount":  null,
                                 "SuccessCount":  null
                             },
    "DeviceStatuses":  null,
    "DisplayName":  "Device-Restriction-Profile",
    "GroupAssignments":  null,
    "Id":  "",
    "LastModifiedDateTime":  "\/Date(1756899057913)\/",
    "RoleScopeTagIds":  [
                            "0"
                        ],
    "SupportsScopeTags":  true,
    "UserStatusOverview":  {
                               "ConfigurationVersion":  null,
                               "ConflictCount":  null,
                               "ErrorCount":  null,
                               "FailedCount":  null,
                               "Id":  null,
                               "LastUpdateDateTime":  null,
                               "NotApplicableCount":  null,
                               "PendingCount":  null,
                               "SuccessCount":  null
                           },
    "UserStatuses":  null,
    "Version":  25,
    "AdditionalProperties":  {
                                 "@odata.type":  "#microsoft.graph.windows10GeneralConfiguration",
                                 "networkProxyApplySettingsDeviceWide":  false,
                                 "networkProxyDisableAutoDetect":  false,
                                 "microsoftAccountSignInAssistantSettings":  "notConfigured",
                                 "authenticationAllowSecondaryDevice":  false,
                                 "authenticationWebSignIn":  "notConfigured",
                                 "bluetoothAllowedServices":  [

                                                              ],
                                 "bluetoothBlockAdvertising":  true,
                                 "bluetoothBlockPromptedProximalConnections":  true,
                                 "bluetoothBlockDiscoverableMode":  true,
                                 "bluetoothBlockPrePairing":  true,
                                 "edgeBlockAutofill":  false,
                                 "edgeBlocked":  false,
                                 "edgeCookiePolicy":  "userDefined",
                                 "edgeBlockDeveloperTools":  false,
                                 "edgeBlockSendingDoNotTrackHeader":  false,
                                 "edgeBlockExtensions":  false,
                                 "edgeBlockInPrivateBrowsing":  false,
                                 "edgeBlockJavaScript":  false,
                                 "edgeBlockPasswordManager":  false,
                                 "edgeBlockAddressBarDropdown":  false,
                                 "edgeBlockCompatibilityList":  false,
                                 "edgeClearBrowsingDataOnExit":  false,
                                 "edgeAllowStartPagesModification":  false,
                                 "edgeDisableFirstRunPage":  false,
                                 "edgeBlockLiveTileDataCollection":  false,
                                 "edgeSyncFavoritesWithInternetExplorer":  false,
                                 "edgeBlockEditFavorites":  false,
                                 "edgeHomeButtonConfigurationEnabled":  false,
                                 "edgeOpensWith":  "specificPages",
                                 "edgeBlockSideloadingExtensions":  false,
                                 "edgeRequiredExtensionPackageFamilyNames":  [

                                                                             ],
                                 "edgeBlockPrinting":  false,
                                 "edgeFavoritesBarVisibility":  "notConfigured",
                                 "edgeBlockSavingHistory":  false,
                                 "edgeBlockFullScreenMode":  false,
                                 "edgeBlockWebContentOnNewTabPage":  true,
                                 "edgeBlockTabPreloading":  false,
                                 "edgeBlockPrelaunch":  false,
                                 "edgeShowMessageWhenOpeningInternetExplorerSites":  "notConfigured",
                                 "edgePreventCertificateErrorOverride":  false,
                                 "edgeKioskModeRestriction":  "publicBrowsingSingleApp",
                                 "cellularBlockDataWhenRoaming":  true,
                                 "cellularBlockVpn":  true,
                                 "cellularBlockVpnWhenRoaming":  true,
                                 "cellularData":  "blocked",
                                 "enableAutomaticRedeployment":  false,
                                 "cryptographyAllowFipsAlgorithmPolicy":  false,
                                 "defenderRequireRealTimeMonitoring":  true,
                                 "defenderRequireBehaviorMonitoring":  true,
                                 "defenderRequireNetworkInspectionSystem":  true,
                                 "defenderScanDownloads":  true,
                                 "defenderScheduleScanEnableLowCpuPriority":  false,
                                 "defenderDisableCatchupQuickScan":  false,
                                 "defenderDisableCatchupFullScan":  false,
                                 "defenderScanScriptsLoadedInInternetExplorer":  false,
                                 "defenderBlockEndUserAccess":  false,
                                 "defenderMonitorFileActivity":  "userDefined",
                                 "defenderScanMaxCpu":  30,
                                 "defenderScanArchiveFiles":  true,
                                 "defenderScanIncomingMail":  true,
                                 "defenderScanRemovableDrivesDuringFullScan":  true,
                                 "defenderScanMappedNetworkDrivesDuringFullScan":  false,
                                 "defenderScanNetworkFiles":  true,
                                 "defenderRequireCloudProtection":  false,
                                 "defenderCloudBlockLevel":  "notConfigured",
                                 "defenderPromptForSampleSubmission":  "userDefined",
                                 "defenderScanType":  "userDefined",
                                 "defenderSystemScanSchedule":  "userDefined",
                                 "defenderPotentiallyUnwantedAppAction":  "audit",
                                 "defenderPotentiallyUnwantedAppActionSetting":  "userDefined",
                                 "defenderBlockOnAccessProtection":  false,
                                 "defenderFileExtensionsToExclude":  [

                                                                     ],
                                 "defenderFilesAndFoldersToExclude":  [

                                                                      ],
                                 "defenderProcessesToExclude":  [

                                                                ],
                                 "displayAppListWithGdiDPIScalingTurnedOn":  [

                                                                             ],
                                 "displayAppListWithGdiDPIScalingTurnedOff":  [

                                                                              ],
                                 "experienceDoNotSyncBrowserSettings":  "notConfigured",
                                 "lockScreenAllowTimeoutConfiguration":  false,
                                 "lockScreenBlockActionCenterNotifications":  true,
                                 "lockScreenBlockCortana":  false,
                                 "lockScreenBlockToastNotifications":  false,
                                 "lockScreenActivateAppsWithVoice":  "disabled",
                                 "messagingBlockSync":  true,
                                 "messagingBlockMMS":  true,
                                 "messagingBlockRichCommunicationServices":  true,
                                 "passwordBlockSimple":  false,
                                 "passwordRequired":  false,
                                 "passwordRequireWhenResumeFromIdleState":  false,
                                 "passwordRequiredType":  "deviceDefault",
                                 "powerLidCloseActionOnBattery":  "noAction",
                                 "powerLidCloseActionPluggedIn":  "noAction",
                                 "powerButtonActionOnBattery":  "noAction",
                                 "powerButtonActionPluggedIn":  "noAction",
                                 "powerSleepButtonActionOnBattery":  "noAction",
                                 "powerSleepButtonActionPluggedIn":  "noAction",
                                 "powerHybridSleepOnBattery":  "disabled",
                                 "powerHybridSleepPluggedIn":  "disabled",
                                 "printerNames":  [

                                                  ],
                                 "printerBlockAddition":  false,
                                 "privacyAdvertisingId":  "notConfigured",
                                 "privacyAutoAcceptPairingAndConsentPrompts":  false,
                                 "privacyDisableLaunchExperience":  false,
                                 "privacyBlockInputPersonalization":  true,
                                 "privacyBlockPublishUserActivities":  true,
                                 "privacyBlockActivityFeed":  true,
                                 "activateAppsWithVoice":  "notConfigured",
                                 "searchBlockDiacritics":  false,
                                 "searchDisableAutoLanguageDetection":  false,
                                 "searchDisableIndexingEncryptedItems":  false,
                                 "searchEnableRemoteQueries":  false,
                                 "searchDisableUseLocation":  false,
                                 "searchDisableLocation":  false,
                                 "searchDisableIndexerBackoff":  false,
                                 "searchDisableIndexingRemovableDrive":  false,
                                 "searchEnableAutomaticIndexSizeManangement":  false,
                                 "searchBlockWebResults":  true,
                                 "findMyFiles":  "notConfigured",
                                 "securityBlockAzureADJoinedDevicesAutoEncryption":  false,
                                 "settingsBlockSettingsApp":  false,
                                 "settingsBlockSystemPage":  false,
                                 "settingsBlockDevicesPage":  false,
                                 "settingsBlockNetworkInternetPage":  false,
                                 "settingsBlockPersonalizationPage":  false,
                                 "settingsBlockAccountsPage":  false,
                                 "settingsBlockTimeLanguagePage":  false,
                                 "settingsBlockEaseOfAccessPage":  true,
                                 "settingsBlockPrivacyPage":  true,
                                 "settingsBlockUpdateSecurityPage":  false,
                                 "settingsBlockAppsPage":  false,
                                 "settingsBlockGamingPage":  true,
                                 "smartScreenEnableAppInstallControl":  false,
                                 "smartScreenAppInstallControl":  "notConfigured",
                                 "startBlockUnpinningAppsFromTaskbar":  true,
                                 "startMenuAppListVisibility":  "userDefined",
                                 "startMenuHideChangeAccountSettings":  false,
                                 "startMenuHideFrequentlyUsedApps":  true,
                                 "startMenuHideHibernate":  true,
                                 "startMenuHideLock":  true,
                                 "startMenuHidePowerButton":  false,
                                 "startMenuHideRecentJumpLists":  true,
                                 "startMenuHideRecentlyAddedApps":  true,
                                 "startMenuHideRestartOptions":  false,
                                 "startMenuHideShutDown":  true,
                                 "startMenuHideSignOut":  false,
                                 "startMenuHideSleep":  true,
                                 "startMenuHideSwitchAccount":  true,
                                 "startMenuHideUserTile":  false,
                                 "startMenuMode":  "userDefined",
                                 "startMenuPinnedFolderDocuments":  "hide",
                                 "startMenuPinnedFolderDownloads":  "hide",
                                 "startMenuPinnedFolderFileExplorer":  "hide",
                                 "startMenuPinnedFolderHomeGroup":  "hide",
                                 "startMenuPinnedFolderMusic":  "hide",
                                 "startMenuPinnedFolderNetwork":  "notConfigured",
                                 "startMenuPinnedFolderPersonalFolder":  "hide",
                                 "startMenuPinnedFolderPictures":  "hide",
                                 "startMenuPinnedFolderSettings":  "show",
                                 "startMenuPinnedFolderVideos":  "hide",
                                 "diagnosticsDataSubmissionMode":  "userDefined",
                                 "oneDriveDisableFileSync":  false,
                                 "edgeTelemetryForMicrosoft365Analytics":  "notConfigured",
                                 "taskManagerBlockEndTask":  false,
                                 "inkWorkspaceAccess":  "notConfigured",
                                 "inkWorkspaceAccessState":  "notConfigured",
                                 "inkWorkspaceBlockSuggestedApps":  false,
                                 "windowsSpotlightBlockConsumerSpecificFeatures":  false,
                                 "windowsSpotlightBlocked":  false,
                                 "windowsSpotlightBlockOnActionCenter":  false,
                                 "windowsSpotlightBlockTailoredExperiences":  false,
                                 "windowsSpotlightBlockThirdPartyNotifications":  false,
                                 "windowsSpotlightBlockWelcomeExperience":  false,
                                 "windowsSpotlightBlockWindowsTips":  false,
                                 "windowsSpotlightConfigureOnLockScreen":  "notConfigured",
                                 "accountsBlockAddingNonMicrosoftAccountEmail":  true,
                                 "antiTheftModeBlocked":  false,
                                 "bluetoothBlocked":  true,
                                 "cameraBlocked":  false,
                                 "connectedDevicesServiceBlocked":  true,
                                 "certificatesBlockManualRootCertificateInstallation":  true,
                                 "copyPasteBlocked":  true,
                                 "cortanaBlocked":  true,
                                 "deviceManagementBlockFactoryResetOnMobile":  true,
                                 "deviceManagementBlockManualUnenroll":  true,
                                 "safeSearchFilter":  "strict",
                                 "edgeBlockPopups":  false,
                                 "edgeBlockSearchSuggestions":  false,
                                 "edgeBlockSearchEngineCustomization":  false,
                                 "edgeBlockSendingIntranetTrafficToInternetExplorer":  false,
                                 "edgeSendIntranetTrafficToInternetExplorer":  false,
                                 "edgeRequireSmartScreen":  false,
                                 "edgeHomepageUrls":  [

                                                      ],
                                 "edgeBlockAccessToAboutFlags":  true,
                                 "smartScreenBlockPromptOverride":  true,
                                 "smartScreenBlockPromptOverrideForFiles":  false,
                                 "webRtcBlockLocalhostIpAddress":  false,
                                 "internetSharingBlocked":  true,
                                 "settingsBlockAddProvisioningPackage":  false,
                                 "settingsBlockRemoveProvisioningPackage":  false,
                                 "settingsBlockChangeSystemTime":  false,
                                 "settingsBlockEditDeviceName":  true,
                                 "settingsBlockChangeRegion":  false,
                                 "settingsBlockChangeLanguage":  false,
                                 "settingsBlockChangePowerSleep":  false,
                                 "locationServicesBlocked":  false,
                                 "microsoftAccountBlocked":  false,
                                 "microsoftAccountBlockSettingsSync":  false,
                                 "nfcBlocked":  true,
                                 "resetProtectionModeBlocked":  false,
                                 "screenCaptureBlocked":  true,
                                 "storageBlockRemovableStorage":  false,
                                 "storageRequireMobileDeviceEncryption":  false,
                                 "usbBlocked":  false,
                                 "voiceRecordingBlocked":  true,
                                 "wiFiBlockAutomaticConnectHotspots":  false,
                                 "wiFiBlocked":  false,
                                 "wiFiBlockManualConfiguration":  false,
                                 "wirelessDisplayBlockProjectionToThisDevice":  true,
                                 "wirelessDisplayBlockUserInputFromReceiver":  true,
                                 "wirelessDisplayRequirePinForPairing":  true,
                                 "windowsStoreBlocked":  true,
                                 "appsAllowTrustedAppsSideloading":  "notConfigured",
                                 "windowsStoreBlockAutoUpdate":  true,
                                 "developerUnlockSetting":  "blocked",
                                 "sharedUserAppDataAllowed":  false,
                                 "appsBlockWindowsStoreOriginatedApps":  false,
                                 "windowsStoreEnablePrivateStoreOnly":  true,
                                 "storageRestrictAppDataToSystemVolume":  false,
                                 "storageRestrictAppInstallToSystemVolume":  false,
                                 "gameDvrBlocked":  true,
                                 "experienceBlockDeviceDiscovery":  true,
                                 "experienceBlockErrorDialogWhenNoSIM":  true,
                                 "experienceBlockTaskSwitcher":  false,
                                 "logonBlockFastUserSwitching":  true,
                                 "tenantLockdownRequireNetworkDuringOutOfBoxExperience":  false,
                                 "appManagementMSIAllowUserControlOverInstall":  false,
                                 "appManagementMSIAlwaysInstallWithElevatedPrivileges":  false,
                                 "appManagementPackageFamilyNamesToLaunchAfterLogOn":  [

                                                                                       ],
                                 "uninstallBuiltInApps":  false,
                                 "edgeHomeButtonConfiguration":  {
                                                                     "@odata.type":  "#microsoft.graph.edgeHomeButtonOpensCustomURL"
                                                                 },
                                 "defenderDetectedMalwareActions":  {
                                                                        "lowSeverity":  "deviceDefault",
                                                                        "moderateSeverity":  "deviceDefault",
                                                                        "highSeverity":  "quarantine",
                                                                        "severeSeverity":  "remove"
                                                                    }
                             }
}
